export const searchDatabase = [

  // ==========================================
  // 1. حسابك الشخصي (صاحب البورتفوليو - ID: 0)
  // ==========================================
  {
    id: 0,
    type: "people",
    title: "محمد منصور حسن",
    username: "mohamedmansour",
    desc: "محمد منصور حسن mohamedmansour",
    img: "/src/assets/imgs/MohamedMansour.JPG",
    details: {
      role: "مصمم ومطور رقمي",
      bio: "هلا بيك في منصتي الرقمية. أنا مصمم ومطور مواقع، متخصص في بناء وتطوير المواقع الإلكترونية وتصميم الهويات الرقمية الشاملة، أركز على تحويل الأفكار إلى واجهات عمليّة وتجارب مستخدم سلسة تهتم بأدق التفاصيل البصرية والأداء العالي.",
      social: {
        github: "https://github.com/mohamedmansour277",
        linkedin: "",
      },
      isOwner: true,
    },
  },


















  // ==========================================
  // 2. فئة المنتجات الرقمية (المشاريع)
  // ==========================================
  {
    id: 2000, 
    type: "products", // نوع العنصر وثابت لجميع المنتجات
    title: "منصة إرث",
    username: "erth", // اسم المستخدم الخاص بك (اختياري، لكن يضيف لمسة شخصية)
    desc: "منصة متخصصة لحفظ وتوثيق الهوية الرقمية، الإرث العائلي، والذكريات الشخصية للأجيال القادمة بأسلوب تفاعلي راقٍ.",
    img: "/src/assets/icons/erth.svg", // مسار لوجو أو صورة المنتج الدائرية
    isOwner: true,
    // 🎯 هنا التفاصيل المتقدمة اللي الصفحة الجديدة معتمدة عليها بالكامل:
    details: {
      concept:
          "منصة رقمية ذات طابع نيتش (Niche) فريد، قمت بتصميمها وتطويرها لحل مشكلة زوال واختفاء المحتوى الرقمي الشخصي عبر الزمن. 'إرث' ليس مجرد شبكة تواصل اجتماعي عامة، بل هو خزنة وبوتيك رقمي دافئ وعالي الخصوصية، يُمكِّن العائلات والأفراد من الحفاظ على ذكرياتهم، وتوثيق سجلاتهم الشخصية، وحفظ رسائلهم المستقبلية وهويتهم الرقمية لتقدم كإرث أصيل للأجيال القادمة. وقد حرصت في بناء هذه المنصة على تقديم تجربة بصرية فاخرة مستوحاة من جماليات شركة Apple البسيطة، مع دمج تأثيرات الزجاج (Glassmorphism) والتفاعلات الحركية الناعمة باستخدام لغة JavaScript الصافية (Vanilla JS)، لتعطي المستخدم إحساساً بالأمان، والأصالة، والفخامة أثناء تصفح وتوثيق تفاصيل حياته وإرثه العائلي الحساس.",
          liveUrl: "", // رابط معاينة الموقع الحي (الزرار الأخضر)

      dateFinished: "2026-05-07", // تاريخ انتهاء المشروع (هيتحول تلقائياً لـ: 20 مايو 2026)

      // 👥 الأيدي الخاص بالمطورين المشاركين في المشروع (لازم الأرقام دي تطابق id أشخاص موجودين في نفس قاعدة البيانات)
      teamIds: [0, 1, 2, 3, 4],

      facebookLink: "",
      instagramLink: "",
      linkedinLink: "",
      githubLink: "",
      tiktokLink: "",
      // 🛠️ المصفوفة الخاصة بالتقنيات المستخدمة في بناء المنتج
      tools: [
        "Vercel",
        "Google Font Api",
        "JavaScript (ES6+)",
        "Figma (UI/UX)",
        "HTML5",
        "CSS3",
        "Gsap",
        // "Gsap",
      ],
    },
  },
  {
    id: 2001, 
    type: "products", // نوع العنصر وثابت لجميع المنتجات
    title: "حاسبات ومعلومات العريش",
    username: "fci-aru", // اسم المستخدم الخاص بك (اختياري، لكن يضيف لمسة شخصية)
    desc: "موقع لكلية حاسبات ومعلومات العريش يحتوي على تلخيصيات وبنوك أسئلة لمساعدة الطلبة",
    img: "/src/assets/icons/fci.svg", // مسار لوجو أو صورة المنتج الدائرية
    isOwner: true,
    // 🎯 هنا التفاصيل المتقدمة اللي الصفحة الجديدة معتمدة عليها بالكامل:
    details: {
      concept:
          "منصة رقمية خدمية قمت بتطويرها خصيصاً لخدمة زملائي ومجتمع كليتي (حاسبات ومعلومات العريش)، وحرصت في تصميمها أن تكون خفيفة وسريعة ومجهزة بدقة لتوفير تجربة تصفح مثالية عبر الهواتف المحمولة. تهدف المنصة إلى تسهيل حياة الطلاب من خلال توفير وصول فوري وبحث ذكي داخل أرشيف شامل للملخصات الدراسية وبنوك الأسئلة المنظمة في مكان واحد، كما قمت ببناء النظام ببنية برمجية مرنة ومعدة مستقبلاً لاستيعاب متجر إلكتروني وسوق تبادل متكامل يلبي كافة احتياجاتنا الأكاديمية والتقنية.",
          liveUrl: "https://fci-aru.vercel.app/", // رابط معاينة الموقع الحي (الزرار الأخضر)

      dateFinished: "2025-11-27", // تاريخ انتهاء المشروع (هيتحول تلقائياً لـ: 20 مايو 2026)

      // 👥 الأيدي الخاص بالمطورين المشاركين في المشروع (لازم الأرقام دي تطابق id أشخاص موجودين في نفس قاعدة البيانات)
      teamIds: [0],

      facebookLink: "https://www.facebook.com/share/1BbpHS5K3T/?mibextid=wwXIfr",
      instagramLink: "",
      linkedinLink: "",
      githubLink: "",
      tiktokLink: "",
      // 🛠️ المصفوفة الخاصة بالتقنيات المستخدمة في بناء المنتج
      tools: [
        "Vercel",
        "Google Font Api",
        "JavaScript (ES6+)",
        "Figma (UI/UX)",
        "HTML5",
        "CSS3",
      ],
      
    },
  },
  {
    id: 2002, 
    type: "products", // نوع العنصر وثابت لجميع المنتجات
    title: "ترافيلو - Travelo",
    username: "travelo", // اسم المستخدم الخاص بك (اختياري، لكن يضيف لمسة شخصية)
    desc: "موقع تدريبي لشركة افتراضية باسم Travelo يقدم خدمات التنقل والتواصل مع المسافرين والمحامين بشكل مجاني ومتميز على الأنظمة المتعددة والاقتصادية للشركات العامة في منطقة أمريكا الوسطى والمتحدة.",
    img: "/src/assets/icons/travelo.svg", // مسار لوجو أو صورة المنتج الدائرية
    isOwner: true,
    // 🎯 هنا التفاصيل المتقدمة اللي الصفحة الجديدة معتمدة عليها بالكامل:
    details: {
      concept:
          "منصة Travelo الرقمية: موقع تدريبي وبنية برمجية متكاملة لشركة افتراضية متخصصة في تقديم خدمات التنقل الذكي، الربط اللوجستي، والتواصل الفوري بين المسافرين والمستشارين القانونيين والمحامين بشكل مجاني ومتميز. تم تطوير واجهات المشروع برمجياً بالاعتماد على لغات الويب الأساسية (HTML5, CSS3, JavaScript) مع دمج جزئي وبسيط لمكتبة Bootstrap في عناصر محددة لتوفير مرونة وتجاوب إضافي، مما يضمن تحقيق أعلى معدلات الاستجابة والأداء العالي للأنظمة المتعددة والاقتصادية التي تخدم الشركات العامة في منطقة أمريكا الوسطى والمتحدة.",
          liveUrl: "https://travelo-livid.vercel.app/", // رابط معاينة الموقع الحي (الزرار الأخضر)

      dateFinished: "2025-9-14", // تاريخ انتهاء المشروع (هيتحول تلقائياً لـ: 20 مايو 2026)

      // 👥 الأيدي الخاص بالمطورين المشاركين في المشروع (لازم الأرقام دي تطابق id أشخاص موجودين في نفس قاعدة البيانات)
      teamIds: [0 , 6, 7,8],

      facebookLink: "",
      instagramLink: "",
      linkedinLink: "",
      githubLink: "",
      tiktokLink: "",
      // 🛠️ المصفوفة الخاصة بالتقنيات المستخدمة في بناء المنتج
      tools: [
        "Vercel",
        "Google Font Api",
        "JavaScript (ES6+)",
        "Figma (UI/UX)",
        "HTML5",
        "CSS3",
        "Bootstrap",
      ],
      
    },
  },

  // {
  //   id: 2002, 
  //   type: "products", // نوع العنصر وثابت لجميع المنتجات
  //   title: "بينوكيو",
  //   username: "pinonocchio", // اسم المستخدم الخاص بك (اختياري، لكن يضيف لمسة شخصية)
  //   desc: "متجر إلكتروني ذكي يعتمد على خوارزميات الذكاء الاصطناعي لتحليل سلوك المتسوقين وتقديم تجربة شراء ديناميكية مخصصة بالكامل.",
  //   img: "/src/assets/icons/pinocchio.svg", // مسار لوجو أو صورة المنتج الدائرية
  //   isOwner: true,
  //   // 🎯 هنا التفاصيل المتقدمة اللي الصفحة الجديدة معتمدة عليها بالكامل:
  //   details: {
  //     concept:
  //         "منصة تجارة إلكترونية ثورية تعتمد في جوهرها على دمج خوارزميات الذكاء الاصطناعي لتحليل سلوك المستخدم (User Behavior Analytics) بشكل لحظي ومباشر. الفكرة البرمجية لـ 'بينوكيو' تقوم على تتبع نمط تصفح العميل، وقياس معدل بقائه وتفاعله مع كل منتج، ومن ثم التنبؤ بمدى جدية رغبته في الشراء أو تردده. بناءً على هذه البيانات، يقوم محرك الذكاء الاصطناعي المدمج بالمنصة باتخاذ قرارات ديناميكية فورية؛ مثل تقديم خصومات مخصصة وذكية في الوقت المناسب لتحفيز الشراء، أو تعديل ترتيب المنتجات وترشيح بدائل دقيقة تتوافق تماماً مع اهتمام العميل الحالي. الهدف الأساسي من المشروع هو تحويل المتجر التقليدي الثابت إلى بيئة تفاعلية ذكية تفهم سيكولوجية المتسوق رقمياً وتساعد في رفع معدل التحويل والمبيعات (Conversion Rate) بآلية برمجية مؤتمتة بالكامل.",
  //     liveUrl: "", // رابط معاينة الموقع الحي (الزرار الأخضر)

  //     dateFinished: "2026-02-29", // تاريخ انتهاء المشروع (هيتحول تلقائياً لـ: 20 مايو 2026)

  //     // 👥 الأيدي الخاص بالمطورين المشاركين في المشروع (لازم الأرقام دي تطابق id أشخاص موجودين في نفس قاعدة البيانات)
  //     teamIds: [0, 5],

  //     facebookLink: "",
  //     instagramLink: "",
  //     linkedinLink: "",
  //     githubLink: "",
  //     tiktokLink: "",
  //     // 🛠️ المصفوفة الخاصة بالتقنيات المستخدمة في بناء المنتج
  //     tools: [
  //       "JavaScript (ES6+)",
  //       "HTML5",
  //       "CSS3",
  //       "AI Recommendation Engine",
  //       "User Behavior Analytics",
  //       "Figma (UI/UX)"
  //     ],
      
  //   },
  // },
  














  // ==========================================
  // 3. فئة أعضاء فرق العمل (People)
  // ==========================================

  {
    id: 1,
    type: "people",
    title: "آدم محمد سلامة",
    username: "adam-mohamed",
    desc: "ادم محمد سلامة adam mohamed",
    img: "https://media.licdn.com/dms/image/v2/D4D03AQFYkmNKHBJRFw/profile-displayphoto-scale_400_400/B4DZuxVw10JgAg-/0/1768206831774?e=1781136000&v=beta&t=2ZjxkhRh-tVEr4FnREWWqNeZ1omfwRU-iHqZ-QNXxTg",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/adam-mohamed-0255932b8/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مطور واجهة خلفية",
      bio: "مطور واجهة خلفية يركز على بناء وتأمين قواعد البيانات وتصميم خلفيات برمجية مستقرة للمشاريع. يمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعله شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      social: { github: "#", linkedin: "#" },
      isOwner: false,
    },
  },
  {
    id: 2,
    type: "people",
    title: "كريم وائل محمد",
    username: "kareem-wael",
    desc: "كريم وائل محمد kareem wael",
    img: "https://media.licdn.com/dms/image/v2/D5603AQHEf_iEaRc34w/profile-displayphoto-shrink_200_200/B56Zedu.qaHEAY-/0/1750698030187?e=1781136000&v=beta&t=QkJPw9WLM2zFHfbWoDzuobJ6c_fgaVx3Nh2DN8r3AMs",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/kareem-w-2a2769325/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مصمم ويب",
      bio: "مطور واجهة أمامية يركز على بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. يمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعله شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  {
    id: 3,
    type: "people",
    title: "عمر محمود الليثي",
    username: "omar-mahmoud",
    desc: "عمر محمود الليثي omar mahmoud",
    img: "https://media.licdn.com/dms/image/v2/D4D03AQGiU9MiWitJZA/profile-displayphoto-scale_200_200/B4DZ2bw4B0I4Ag-/0/1776434791478?e=1783555200&v=beta&t=sAxS5FZDAvsyuErrek3hIQq0SUIA7-a1EW4yXgCXLjQ",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/omar-ellithey/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مطور ويب",
      bio: "مطور واجهة أمامية يركز على بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. يمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعله شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  {
    id: 4,
    type: "people",
    title: "علي نصار",
    username: "ali-nassar",
    desc: "علي نصار ali nassar",
    img: "https://media.licdn.com/dms/image/v2/D4E03AQFDK6FIRr5dwQ/profile-displayphoto-crop_800_800/B4EZtdCpDGJwAM-/0/1766792534327?e=1781136000&v=beta&t=IoygbfQ2aJXT771quZX9Ck-whJwi8y9ZnnAcYZY8_lM",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/aly-nassar-168452389/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مطور ويب",
      bio: "مطور واجهة أمامية يركز على بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. يمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعله شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  {
    id: 5,
    type: "people",
    title: "سيف الدين عابد",
    username: "saif-abed",
    desc: 
    " سيف الدين عابد saif abed seif",
    img: "https://media.licdn.com/dms/image/v2/D4E03AQH1b2kg_cbMXw/profile-displayphoto-crop_800_800/B4EZj2ltgNIIAI-/0/1756483740772?e=1781740800&v=beta&t=UKXCRFVd0xPrmtNtFg0rKx7KgvGwWB4aKDqeisByKWY",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/saif-abed-10433a372/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "فل ستاك",
      bio: "مطور واجهة أمامية يركز على بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. يمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعله شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  {
    id: 6,
    type: "people",
    title: "محمد حسن",
    username: "mohamed-hassan",
    desc: 
      " محمد حسن mohamed hassan",
    img: "https://media.licdn.com/dms/image/v2/D4D35AQGxLPC95mn8jQ/profile-framedphoto-shrink_800_800/B4DZ2WB058HYAg-/0/1776338554848?e=1780664400&v=beta&t=mHvEq5JvfhMQlziWQvZ9hfSFzDhRoWqf2ar12Hp4R-4",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/mohamed-hassan-273b81298/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مطور واجهة أمامية",
      bio: "مطور واجهة أمامية يركز على بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. يمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعله شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  {
    id: 7,
    type: "people",
    title: "أمل المسلماني",
    username: "aml-medhat",
    desc:
      " امل مدحت aml medhat amal elmosalamany",
    img: "",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/aml-elmoslamany-258b72320/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مطور واجهة أمامية",
      bio: "مطورة واجهة أمامية تعتمد في بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. تمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعلها شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  {
    id: 8,
    type: "people",
    title: "آيه محمد",
    username: "aya-mohamed",
    desc: 
      "ايه محمد aya mohamed ",
    img: "",
    facebookLink: "",
    instagramLink: "",
    linkedinLink: "https://www.linkedin.com/in/aya-mohammed-2260a8379/",
    githubLink: "",
    tiktokLink: "",
    details: {
      role: "مطور واجهة أمامية",
      bio: "مطورة واجهة أمامية تعتمد في بناء وتأمين واجهات المستخدم وتصميم تجارب تصفح ممتازة للمشاريع. تمتلك مهارة في كتابة الكود النظيف وإدارة البيانات بكفاءة، مما يجعلها شريكاً تقنياً يعتمد عليه في تحويل الأفكار إلى بنية برمجية قابلة للتوسع.",
      isOwner: false,
    },
  },
  
  {
    id: 27,
    type: "people",
    title: "27",
    username: "secret",
    desc: "27",
    img: "src/assets/imgs/nopic.jpg",
    details: {
      role: "سري",
      bio: "لسه محطتش حاجة سرية",
      isOwner: true,
    },
  },




  
  // ==========================================
  // 4. فئة المنشورات والمقالات (Tags)
  // ==========================================
  
  
  
//   {
//   id: 5004,
//   type: "tags",
//   username: "alzheimer-initiative",
//   title: "اختبار المنشور مالح",
//   postCategory: "tech", // الفئة اللي بتترجم فوق
//   authorId: 0, // الـ id بتاع الشخص المطور عشان يسحب صورته واسمه تلقائياً
//   img: "/src/assets/imgs/nopic.jpg",
//   date: "2026-05-07",
//   desc: "  هذا المنشور هو مجرد اختبار لعرض تفاصيل منشور بدون وجود بيانات حقيقية في قاعدة البيانات، الهدف منه هو التأكد من أن صفحة تفاصيل المنشور يمكنها التعامل مع حالات البيانات الناقصة أو غير المكتملة بشكل أنيق دون كسر التصميم أو تجربة المستخدم.",
//   details: {
//     featuredText: "",
//     longContent: `هنا بقى عيش براحتك واكتب السطور الطويلة والشروحات الكاملة للمشروع.
//     تقدر تنزل كذا سطر تحت بعض وتعمل فواصل للكلام، والـ CSS هيحافظ على التنسيق والـ Line-height الممتاز المتناسق مع بقية صفحات موقعك الـ Boutique.
//     كل التفاصيل الغنية اللي هتزودها هنا هتقرأها الصفحة فوراً وبشكل أوتوماتيكي بالكامل.`,
//     bulletPoints: [
      
//     ]
//   }
// },
//   {
//   id: 5005,
//   type: "tags",
//   username: "alzheimer-initiative2",
//   title: "اختبار3 المنشور مممممالح",
//   postCategory: "sports", // الفئة اللي بتترجم فوق
//   authorId: 0, // الـ id بتاع الشخص المطور عشان يسحب صورته واسمه تلقائياً
//   img: "/src/assets/imgs/nopic.jpg",
//   date: "2026-05-01",
//   desc: "  هذا المنشور هو مجرد اختبار لعرض تفاصيل منشور بدون وجود بيانات حقيقية في قاعدة البيانات، الهدف منه هو التأكد من أن صفحة تفاصيل المنشور يمكنها التعامل مع حالات البيانات الناقصة أو غير المكتملة بشكل أنيق دون كسر التصميم أو تجربة المستخدم.",
//   details: {
//     featuredText: "",
//     longContent: `هنا بقى عيش براحتك واكتب السطور الطويلة والشروحات الكاملة للمشروع.
//     تقدر تنزل كذا سطر تحت بعض وتعمل فواصل للكلام، والـ CSS هيحافظ على التنسيق والـ Line-height الممتاز المتناسق مع بقية صفحات موقعك الـ Boutique.
//     كل التفاصيل الغنية اللي هتزودها هنا هتقرأها الصفحة فوراً وبشكل أوتوماتيكي بالكامل.`,
//     bulletPoints: [
//       // "",
//       // "",
//       // ""
//     ]
//   }
// },



];
